experiments/socialnetwork_singlenode/expected_results/mixed_qps5000/wrk_warmup.log
Running 30s test @ http://ip-172-31-8-50.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.135ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.261ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.208ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.242ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.65ms    1.93ms  21.62ms   69.40%
    Req/Sec     1.30k   163.58     2.00k    73.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.87ms
 75.000%    5.32ms
 90.000%    6.61ms
 99.000%    8.53ms
 99.900%   10.69ms
 99.990%   14.66ms
 99.999%   17.55ms
100.000%   21.63ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.683     0.000000            1         1.00
       1.788     0.100000         9964         1.11
       2.099     0.200000        19969         1.25
       2.353     0.300000        29884         1.43
       2.599     0.400000        39853         1.67
       2.873     0.500000        49852         2.00
       3.039     0.550000        54809         2.22
       3.259     0.600000        59789         2.50
       3.579     0.650000        64762         2.86
       4.499     0.700000        69719         3.33
       5.323     0.750000        74698         4.00
       5.555     0.775000        77210         4.44
       5.767     0.800000        79690         5.00
       5.963     0.825000        82173         5.71
       6.163     0.850000        84670         6.67
       6.375     0.875000        87180         8.00
       6.487     0.887500        88410         8.89
       6.615     0.900000        89666        10.00
       6.743     0.912500        90897        11.43
       6.887     0.925000        92146        13.33
       7.051     0.937500        93380        16.00
       7.147     0.943750        94002        17.78
       7.251     0.950000        94624        20.00
       7.367     0.956250        95240        22.86
       7.499     0.962500        95867        26.67
       7.651     0.968750        96499        32.00
       7.743     0.971875        96806        35.56
       7.831     0.975000        97115        40.00
       7.939     0.978125        97431        45.71
       8.043     0.981250        97746        53.33
       8.175     0.984375        98044        64.00
       8.271     0.985938        98206        71.11
       8.351     0.987500        98353        80.00
       8.471     0.989062        98509        91.43
       8.583     0.990625        98670       106.67
       8.743     0.992188        98821       128.00
       8.831     0.992969        98898       142.22
       8.967     0.993750        98976       160.00
       9.063     0.994531        99054       182.86
       9.183     0.995313        99135       213.33
       9.343     0.996094        99208       256.00
       9.447     0.996484        99253       284.44
       9.543     0.996875        99287       320.00
       9.679     0.997266        99327       365.71
       9.839     0.997656        99365       426.67
      10.039     0.998047        99406       512.00
      10.159     0.998242        99423       568.89
      10.279     0.998437        99442       640.00
      10.375     0.998633        99463       731.43
      10.463     0.998828        99481       853.33
      10.727     0.999023        99500      1024.00
      10.863     0.999121        99510      1137.78
      10.959     0.999219        99520      1280.00
      11.191     0.999316        99529      1462.86
      11.439     0.999414        99540      1706.67
      11.623     0.999512        99549      2048.00
      11.759     0.999561        99554      2275.56
      12.071     0.999609        99559      2560.00
      12.223     0.999658        99563      2925.71
      12.447     0.999707        99568      3413.33
      12.623     0.999756        99573      4096.00
      13.031     0.999780        99576      4551.11
      13.127     0.999805        99578      5120.00
      13.151     0.999829        99580      5851.43
      13.527     0.999854        99583      6826.67
      14.455     0.999878        99585      8192.00
      14.663     0.999890        99587      9102.22
      14.783     0.999902        99588     10240.00
      15.527     0.999915        99589     11702.86
      15.647     0.999927        99590     13653.33
      15.719     0.999939        99591     16384.00
      15.775     0.999945        99592     18204.44
      15.855     0.999951        99593     20480.00
      15.855     0.999957        99593     23405.71
      15.935     0.999963        99594     27306.67
      15.935     0.999969        99594     32768.00
      16.559     0.999973        99595     36408.89
      16.559     0.999976        99595     40960.00
      16.559     0.999979        99595     46811.43
      17.551     0.999982        99596     54613.33
      17.551     0.999985        99596     65536.00
      17.551     0.999986        99596     72817.78
      17.551     0.999988        99596     81920.00
      17.551     0.999989        99596     93622.86
      21.631     0.999991        99597    109226.67
      21.631     1.000000        99597          inf
#[Mean    =        3.654, StdDeviation   =        1.926]
#[Max     =       21.616, Total count    =        99597]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.06ms
 75.000%    4.67ms
 90.000%    5.79ms
 99.000%    7.67ms
 99.900%    9.75ms
 99.990%   13.45ms
 99.999%   16.46ms
100.000%   20.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.577     0.000000            1         1.00
       1.236     0.100000         9982         1.11
       1.517     0.200000        19925         1.25
       1.685     0.300000        29888         1.43
       1.854     0.400000        39839         1.67
       2.063     0.500000        49821         2.00
       2.203     0.550000        54829         2.22
       2.387     0.600000        59762         2.50
       2.681     0.650000        64759         2.86
       3.819     0.700000        69718         3.33
       4.667     0.750000        74740         4.00
       4.863     0.775000        77215         4.44
       5.039     0.800000        79703         5.00
       5.211     0.825000        82177         5.71
       5.391     0.850000        84693         6.67
       5.579     0.875000        87177         8.00
       5.683     0.887500        88431         8.89
       5.791     0.900000        89654        10.00
       5.911     0.912500        90903        11.43
       6.047     0.925000        92128        13.33
       6.207     0.937500        93393        16.00
       6.291     0.943750        94003        17.78
       6.387     0.950000        94626        20.00
       6.495     0.956250        95243        22.86
       6.631     0.962500        95870        26.67
       6.779     0.968750        96489        32.00
       6.859     0.971875        96796        35.56
       6.947     0.975000        97114        40.00
       7.051     0.978125        97423        45.71
       7.167     0.981250        97730        53.33
       7.303     0.984375        98045        64.00
       7.391     0.985938        98200        71.11
       7.483     0.987500        98362        80.00
       7.587     0.989062        98509        91.43
       7.715     0.990625        98668       106.67
       7.859     0.992188        98820       128.00
       7.947     0.992969        98897       142.22
       8.031     0.993750        98977       160.00
       8.163     0.994531        99054       182.86
       8.287     0.995313        99133       213.33
       8.463     0.996094        99211       256.00
       8.535     0.996484        99249       284.44
       8.679     0.996875        99287       320.00
       8.815     0.997266        99328       365.71
       8.959     0.997656        99365       426.67
       9.095     0.998047        99404       512.00
       9.175     0.998242        99422       568.89
       9.311     0.998437        99442       640.00
       9.447     0.998633        99461       731.43
       9.655     0.998828        99483       853.33
       9.775     0.999023        99500      1024.00
       9.911     0.999121        99511      1137.78
      10.095     0.999219        99520      1280.00
      10.287     0.999316        99532      1462.86
      10.479     0.999414        99539      1706.67
      10.759     0.999512        99549      2048.00
      10.927     0.999561        99554      2275.56
      11.151     0.999609        99559      2560.00
      11.255     0.999658        99563      2925.71
      11.431     0.999707        99568      3413.33
      11.711     0.999756        99573      4096.00
      11.999     0.999780        99576      4551.11
      12.055     0.999805        99578      5120.00
      12.343     0.999829        99580      5851.43
      12.719     0.999854        99583      6826.67
      13.103     0.999878        99585      8192.00
      13.455     0.999890        99587      9102.22
      13.631     0.999902        99588     10240.00
      13.823     0.999915        99589     11702.86
      14.279     0.999927        99590     13653.33
      14.591     0.999939        99591     16384.00
      14.767     0.999945        99592     18204.44
      15.439     0.999951        99593     20480.00
      15.439     0.999957        99593     23405.71
      15.487     0.999963        99594     27306.67
      15.487     0.999969        99594     32768.00
      16.375     0.999973        99595     36408.89
      16.375     0.999976        99595     40960.00
      16.375     0.999979        99595     46811.43
      16.463     0.999982        99596     54613.33
      16.463     0.999985        99596     65536.00
      16.463     0.999986        99596     72817.78
      16.463     0.999988        99596     81920.00
      16.463     0.999989        99596     93622.86
      20.927     0.999991        99597    109226.67
      20.927     1.000000        99597          inf
#[Mean    =        2.935, StdDeviation   =        1.855]
#[Max     =       20.912, Total count    =        99597]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149823 requests in 30.00s, 38.08MB read
Requests/sec:   4994.13
Transfer/sec:      1.27MB